# ViewId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BIMExportOptions..::..ViewId Property
BIMExportOptions Class See Also
---
The element id of the 3D view to export. InvalidElementId by default.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021.1
# Syntax
C#
---
```text
public ElementId ViewId { get; set; }
```

Visual Basic
---
```text
Public Property ViewId As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ ViewId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
BIMExportOptions Class
Autodesk.Revit.DB Namespace